app/views/applications/show.html.erb

<h2>My pet matches:</h2>
<% @application.pets.each do |pet| %>
---
SELECT "pets".* FROM "pets" INNER JOIN "pet_applications" ON "pets"."id" = "pet_applications"."pet_id" WHERE "pet_applications"."application_id" = $1  [["application_id", 5]]