app/controllers/applications_controller.rb

  def show
    @application = Application.find(params[:application_id])

    if params[:pet_name].present?
      @pets = Pet.search(params[:pet_name])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE (name ILIKE '%Spike%')

  def create
    application = Application.new(application_params)

    if application.save
---
INSERT INTO "applications" ("name", "street_address", "description", "city", "state", "zipcode", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    application = Application.find(params[:id])
    application.update(application_params)
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
UPDATE "applications" SET "status" = $1, "updated_at" = $2 WHERE "applications"."id" = $3  [["status", "Pending"], ["updated_at", "2022-05-25 00:01:41.903772"], ["id", 41]]