app/controllers/pet_applications_controller.rb

  def create
    # @application = Application.find(application_id)
    # require "pry"; binding.pry
    @petapplication = PetApplication.create(pet_applications_params)
---
INSERT INTO "pet_applications" ("pet_id", "application_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pet_id", 26], ["application_id", 14], ["created_at", "2022-05-23 19:46:37.755732"], ["updated_at", "2022-05-23 19:46:37.755732"]]