app/controllers/pet_applications_controller.rb

SELECT "applications".* FROM "applications"
---
  def index
    @pet_applications = PetApplication.all

SELECT  "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def show
    @pet_application = PetApplication.find(params[:id])

INSERT INTO "pet_applications" ("pet_id", "application_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["pet_id", 26], ["application_id", 14], ["created_at", "2022-05-23 19:59:35.541141"], ["updated_at", "2022-05-23 19:59:35.541141"]]
---
  def create
    pet_application = PetApplication.new(pet_application_params)

    pet_application.save