app/controllers/pets_controller.rb

    def index
      @pets = Pet.adoptable
      if params[:search_by_name] && params[:search_by_breed] && params[:search_by_age]
        if params[:search_by_age] != ''
          @pets = Pet.where(["name LIKE :name and breed LIKE :breed and age = :age", { name: "%" + params[:search_by_name].capitalize + "%", breed: "%" + params[:search_by_breed] + "%", age: params[:search_by_age]}])
---
SELECT "pets".* FROM "pets" WHERE "pets"."adoptable" = $1  [["adoptable", true]]