app/controllers/shelters_controller.rb

SELECT "shelters".* FROM "shelters" ORDER BY "shelters"."created_at" DESC
---
  def index
    if params[:sort].present? && params[:sort] == "pet_count"
      @shelters = Shelter.order_by_number_of_pets