app/models/application.rb

  def update_status
    if pet_applications.pluck(:condition).all? { |condition| condition == "Approved" }
      self.update(status: "Approved")
---
UPDATE "applications" SET "status" = $1, "updated_at" = $2 WHERE "applications"."id" = $3  [["status", "Pending"], ["updated_at", "2022-05-23 20:36:00.256570"], ["id", 19]]